# Display all rows except first 5 rows

In [ ]:
import pandas as pd
data = pd.read_csv('top-5000-youtube-channels.csv')
data.tail(-5)

In [3]:
# Find Shape of Our Dataset (Number of Rows And Number of Columns)
print(f"Rows: {data.shape[0]}, Columns: {data.shape[1]}")

Rows: 5000, Columns: 6

In [ ]:
# Data Cleaning  (Replace '--'  to NaN)
data.replace('--', pd.NA, inplace=True)

In [7]:
# Check Null Values In The Dataset
import seaborn as sns
data.isnull().sum()

Rank             0
Grade            0
Channel name     0
Video Uploads    0
Subscribers      0
Video views      0
dtype: int64

In [9]:
# Data Cleaning [ Rank Column ]
data[['Rank']]

         Rank
0         1st
1         2nd
2         3rd
3         4th
4         5th
...       ...
4995  4,996th
4996  4,997th
4997  4,998th
4998  4,999th
4999  5,000th

[5000 rows x 1 columns]

In [11]:
# Data Cleaning [ Video uploads and Subscribers Columns ]
data[['Video Uploads', 'Subscribers']]

     Video Uploads Subscribers
0            82757    18752951
1            12661    61196302
2              373    19238251
3            27323    31180559
4            36756    32852346
...            ...         ...
4995           706     2072942
4996           797     1055091
4997           110     3265735
4998          3475       32990
4999           254       21172

[5000 rows x 2 columns]

In [18]:
# Find Average Views For Each Channel
data.groupby('Channel name')['Video views'].mean()

Channel name
#Desenhos Kids BR               8.404115e+07
#FIRST WINGS FILM PRODUCTION    1.267895e+07
#Mentale Zuflucht               3.634114e+08
#Mind Warehouse                 1.337877e+09
#Refugio Mental                 1.262197e+09
                                    ...
핑크퐁 (인기 동요・동화)                  1.595353e+09
허팝Heopop                        1.690027e+09
헤이지니 Hey Jini                   4.550237e+08
헬로카봇 - hello carbot…            3.291915e+08
흔한남매                            1.196532e+08
Name: Video views, Length: 4993, dtype: float64

In [36]:
# Find Out Top Five Channels With Maximum Number of Video Uploads
data['Video Uploads'] = data['Video Uploads'].replace('--', pd.NA).astype('Int64')
top_five_channels = data.nlargest(5, 'Video Uploads')[['Channel name', 'Video Uploads']]
top_five_channels

     Channel name  Video Uploads
3453   AP Archive         422326
1149     YTN NEWS         355996
2223    SBS Drama         335521
323      GMA News         269065
2956          MLB         267649

In [43]:
# Find Correlation Matrix
data['Rank'].corr(other=data['Video views'])

np.float64(0.16801922331929917)

In [45]:
# Which Grade Has A Maximum Number of Video Uploads?
data.nlargest(1, 'Video Uploads')['Grade']

3453    B+
Name: Grade, dtype: object

In [46]:
# Which Grade Has The Highest Average Views?
data.groupby('Grade')['Video views'].mean().idxmax()

'A++ '

In [48]:
# Which Grade Has The Highest Number of Subscribers? 
data['Subscribers'] = pd.to_numeric(data['Subscribers'], errors='coerce')
data.nlargest(1, 'Subscribers')['Grade']

1470    A-
Name: Grade, dtype: object

In [49]:
# Which Grade Has The Highest Video Views? 
data['Video views'] = pd.to_numeric(data['Video views'], errors='coerce')
data.nlargest(1, 'Video views')['Grade']

1    A++
Name: Grade, dtype: object